import React from "react";
import { Link } from "react-router-dom";
import { HandySvg } from "handy-svg";
import { useAppDispatch } from "../../../redux/store";
import { setActiveCatalog, selectCount } from "../../../redux/catalog";

import styles from "./HeaderCatalog.module.scss";

import { ListCatalog } from "../../index";
import { useSelector } from "react-redux";
import { typeList } from "../../../Type";

const listCa: typeList = [
  {
    title: "Щведские стенки1",
    link: "*",
    list: [
      {
        title: "Щведские стенки2-1",
        link: "*",
        list: [
          { title: "Скамьи для пресса3", link: "*" },
          { title: "Скамьи универсальные3", link: "*" },
          { title: "Скамья Скотта3", link: "*" },
          { title: "Скамьи с опциями3", link: "*" },
          { title: "Скамьи со стойками3", link: "*" },
          { title: "Гиперэкстензия3", link: "*" },
        ],
      },
      {
        title: "Мультистанции2-2",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног2-3",
        link: "*",
        list: [
          { title: "Скамьи для пресса-", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы2-4",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья2-5",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Турники",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Уличные комплексы",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Тяжелая атлетика",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Стойки под штангу",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Единоборства",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Фитнес",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Единоборства",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Тубинги",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Батуты",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Бассейны",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Рюкзаки и сумки",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Новогодние ёлки",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Детские игрушки",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Самокаты",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Велосипеды",
    link: "*",
    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
];

export function HeaderCatalog() {
  const status = useSelector(selectCount);
  const dispatch = useAppDispatch();
  return (
    <div className={styles.catalog}>
      <button
        onClick={() => {
          dispatch(setActiveCatalog(!status));
        }}
        className={styles.catalog__nav_btn}>
        <HandySvg src="/img/menu.svg" />
        <p>Каталог товаров</p> <HandySvg src="/img/staticCategory.svg" />
      </button>
      <nav className={styles.catalog__nav__block}>
        <div className={styles.catalog__nav__block_item}>
          <ListCatalog listData={listCa} numberMenu={0} />
        </div>
      </nav>
    </div>
  );
}
