import React from "react";
import { Link } from "react-router-dom";
import { HandySvg } from "handy-svg";
import { useAppDispatch } from "../../../redux/store";
import { setActiveCatalog, selectCount } from "../../../redux/catalog";

import styles from "./HeaderCatalog.module.scss";

import { ListCatalog } from "../../index";
import { useSelector } from "react-redux";
import { typeList } from "../../../Type";

const listCa: typeList = [
  {
    title: "Щведские стенки1",
    list: [
      {
        title: "Щведские стенки2-1",

        list: [
          { title: "Скамьи для пресса3", link: "*" },
          { title: "Скамьи универсальные3" },
          { title: "Скамья Скотта3", link: "*" },
          { title: "Скамьи с опциями3", link: "*" },
          { title: "Скамьи со стойками3", link: "*" },
          { title: "Гиперэкстензия3", link: "*" },
        ],
      },
      {
        title: "Мультистанции2-2",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног2-3",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы2-4",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья2-5",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Турники",

    list: [
      {
        title: "Силовые скамьи и стойки",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",
        link: "*",
      },
      {
        title: "Тренажеры для ног",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",
        link: "*",
      },
    ],
  },
  {
    title: "Уличные комплексы",
    link: "*",
  },
  {
    title: "Тяжелая атлетика",

    list: [
      {
        title: "Силовые скамьи и стойки",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Стойки под штангу",

    list: [
      {
        title: "Силовые скамьи и стойки",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Единоборства",

    list: [
      {
        title: "Силовые скамьи и стойки",
        link: "*",
      },
      {
        title: "Мультистанции",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Фитнес",
    list: [
      {
        title: "Силовые скамьи и стойки",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Единоборства",

    list: [
      {
        title: "Силовые скамьи и стойки",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Тубинги",

    list: [
      {
        title: "Силовые скамьи и стойки",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Батуты",

    list: [
      {
        title: "Силовые скамьи и стойки",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Бассейны",

    list: [
      {
        title: "Силовые скамьи и стойки",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Рюкзаки и сумки",

    list: [
      {
        title: "Силовые скамьи и стойки",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Новогодние ёлки",

    list: [
      {
        title: "Силовые скамьи и стойки",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Детские игрушки",

    list: [
      {
        title: "Силовые скамьи и стойки",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Самокаты",

    list: [
      {
        title: "Силовые скамьи и стойки",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
  {
    title: "Велосипеды",

    list: [
      {
        title: "Силовые скамьи и стойки",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Мультистанции",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Тренажеры для ног",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Силовые рамы",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
      {
        title: "Турники и брусья",

        list: [
          { title: "Скамьи для пресса", link: "*" },
          { title: "Скамьи универсальные", link: "*" },
          { title: "Скамья Скотта", link: "*" },
          { title: "Скамьи с опциями", link: "*" },
          { title: "Скамьи со стойками", link: "*" },
          { title: "Гиперэкстензия", link: "*" },
        ],
      },
    ],
  },
];

export function HeaderCatalog() {
  const status = useSelector(selectCount);

  const dispatch = useAppDispatch();

  const catalogRef = React.useRef<HTMLDivElement>();

  // клик вне компоента
  React.useEffect(() => {
    const handleClickOutside = (
      event: MouseEvent & {
        composedPath: (tar?: HTMLElement) => EventTarget[];
      },
    ) => {
      //console.log("click", event.composedPath());
      if (!event.composedPath().includes(catalogRef.current)) {
        dispatch(setActiveCatalog(false));
      }
    };
    document.body.addEventListener("click", handleClickOutside);
    return () => {
      document.body.removeEventListener("click", handleClickOutside);
    };
  }, []);

  return (
    <div ref={catalogRef} className={styles.catalog}>
      <button
        onClick={() => {
          dispatch(setActiveCatalog(!status));
        }}
        className={styles.catalog__nav_btn}>
        <HandySvg src="/img/menu.svg" />
        <p>Каталог товаров</p> <HandySvg src="/img/staticCategory.svg" />
      </button>
      <nav
        className={`${status ? styles.catalog__nav__block_active : styles.catalog__nav__block} `}>
        <div className={styles.catalog__nav__block_item}>
          <ListCatalog listData={listCa} numberMenu={0} />
        </div>
      </nav>
    </div>
  );
}
