import { typeUserCommit } from "../../Type";

export const usersData: typeUserCommit[] = [
  {
    id: 1,
    last_name: "Константинов",
    first_name: "Константин",
    city: "Москва",
    data: "20.02.2020",
    commit:
      "Душа моя озарена неземной радостью, как эти чудесные весенние утра, которыми я наслаждаюсь от всего сердца. Я совсем один и блаженствую в здешнем краю, словно созданном для таких, как я",
    link: "/*",
    imgUrl: "http://localhost:5030/public/img/usersPhotos/user_1.png",
  },
  {
    id: 2,
    last_name: "Маргаритова",
    first_name: "Маргарита",
    city: "Москва",
    data: "20.02.2020",
    commit:
      "Душа моя озарена неземной радостью, как эти чудесные весенние утра, которыми я наслаждаюсь от всего сердца. Я совсем один и блаженствую в здешнем краю, словно созданном для таких, как я",
    link: "/*",
    imgUrl: "http://localhost:5030/public/img/usersPhotos/user_2.png",
  },
  {
    id: 3,
    last_name: "Маргаритова",
    first_name: "Маргарита",
    city: "Москва",
    data: "20.02.2020",
    commit:
      "Душа моя озарена неземной радостью, как эти чудесные весенние утра, которыми я наслаждаюсь от всего сердца. Я совсем один и блаженствую в здешнем краю, словно созданном для таких, как я",
    link: "/*",
    imgUrl: "http://localhost:5030/public/img/usersPhotos/user_3.png",
  },
  {
    id: 4,
    last_name: "Константинов",
    first_name: "Константин",
    city: "Москва",
    data: "20.02.2020",
    commit:
      "Душа моя озарена неземной радостью, как эти чудесные весенние утра, которыми я наслаждаюсь от всего сердца. Я совсем один и блаженствую в здешнем краю, словно созданном для таких, как я",
    link: "/*",
    imgUrl: "http://localhost:5030/public/img/usersPhotos/user_4.png",
  },
  {
    id: 5,
    last_name: "Маргаритова",
    first_name: "Маргарита",
    city: "Москва",
    data: "20.02.2020",
    commit:
      "Душа моя озарена неземной радостью, как эти чудесные весенние утра, которыми я наслаждаюсь от всего сердца. Я совсем один и блаженствую в здешнем краю, словно созданном для таких, как я",
    link: "/*",
    imgUrl: "http://localhost:5030/public/img/usersPhotos/user_5.png",
  },
  {
    id: 6,
    last_name: "Константинов",
    first_name: "Константин",
    city: "Москва",
    data: "20.02.2020",
    commit:
      "Душа моя озарена неземной радостью, как эти чудесные весенние утра, которыми я наслаждаюсь от всего сердца. Я совсем один и блаженствую в здешнем краю, словно созданном для таких, как я",
    link: "/*",
    imgUrl: "http://localhost:5030/public/img/usersPhotos/user_1.png",
  },
];
